{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"batch_input_shape": [null, null, 1], "implementation": 1, "stateful": false, "return_state": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dropout": 0.0, "kernel_regularizer": null, "unit_forget_bias": true, "activation": "tanh", "recurrent_dropout": 0.0, "unroll": false, "activity_regularizer": null, "name": "lstm_1", "use_bias": true, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "go_backwards": false, "dtype": "float32", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_regularizer": null, "recurrent_constraint": null, "units": 48}}, {"class_name": "Dropout", "config": {"rate": 0.2, "noise_shape": null, "name": "dropout_1", "trainable": true, "seed": null}}, {"class_name": "LSTM", "config": {"implementation": 1, "stateful": false, "return_state": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dropout": 0.0, "kernel_regularizer": null, "unit_forget_bias": true, "activation": "tanh", "recurrent_dropout": 0.0, "unroll": false, "activity_regularizer": null, "name": "lstm_2", "use_bias": true, "recurrent_activation": "hard_sigmoid", "return_sequences": false, "go_backwards": false, "kernel_constraint": null, "recurrent_regularizer": null, "recurrent_constraint": null, "units": 24}}, {"class_name": "Dropout", "config": {"rate": 0.2, "noise_shape": null, "name": "dropout_2", "trainable": true, "seed": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "activation": "linear", "activity_regularizer": null, "name": "dense_1", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "units": 1}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "linear", "trainable": true}}], "keras_version": "2.2.0"}