{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"batch_input_shape": [null, null, 1], "bias_constraint": null, "recurrent_dropout": 0.0, "trainable": true, "kernel_regularizer": null, "units": 12, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "return_state": false, "activation": "tanh", "go_backwards": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "implementation": 1, "dtype": "float32", "unit_forget_bias": true, "return_sequences": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "recurrent_regularizer": null, "stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "unroll": false, "recurrent_constraint": null, "name": "lstm_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "noise_shape": null, "name": "dropout_1", "rate": 0.2, "seed": null}}, {"class_name": "LSTM", "config": {"bias_constraint": null, "recurrent_dropout": 0.0, "return_state": false, "kernel_regularizer": null, "units": 16, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "activation": "tanh", "go_backwards": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "implementation": 1, "unit_forget_bias": true, "return_sequences": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "recurrent_regularizer": null, "stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "unroll": false, "trainable": true, "recurrent_constraint": null, "name": "lstm_2"}}, {"class_name": "Dropout", "config": {"trainable": true, "noise_shape": null, "name": "dropout_2", "rate": 0.2, "seed": null}}, {"class_name": "Dense", "config": {"units": 1, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "name": "dense_1"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "linear"}}], "backend": "tensorflow", "keras_version": "2.2.0"}